/* ЗАДАЧА 2.
Написати функцію pow(x,y) яка буде приймати 2 числа, перше - це число яке ми будемо зводити у ступінь, друге - у яку ступінь.

Наприклад pow(2,3) функція поверне значення 8, тобто два в кубі. 

Умови виконання ДЗ:

Не використовувати **
Не використовувати функції або інші матеріали, які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки */


function pow (x, y) {
    let result = 1; 
    for (let i = 1; i <= y; i++) {
        result = result * x;  //в першому циклі х множиться на 1, а в наступних - попередній результат множиться на х
    }
    return result;
}
let res = pow (2,4);
console.log ("Результат обчислення дорівнює " + res);
//console.log (x + " в ступені " + y + " дорівнює " + res);