/* Необхідно написати програму, яка буде виводити інформацію за умовами, при яких число виводитиметься з правильним словом: "рік", "роки" або "років" (тобто "29 років" чи "4 роки").

Умови виконання ДЗ:

Рік отримувати через prompt()
Зробити перевірку, що користувач ввів число, і це число не є відʼємним.
Не використовувати функції або інші матеріали, які ми не вивчали.
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки.
Будь ласка, надайте наступні дані для перевірки вашої роботи:

Посилання на вашу гілку js_homework2, в якій міститиметься файл з виконаним завданням. */

var age = +prompt ("Скільки Вам років", ""); 
//var age = 3;                                    // якщо не буде бажання перевіряти в браузері - розкоментувати цю строку, закоментувати першу :)
if ((typeof age) != ("number")) {                  // перевірка, що тип введених даних - число
    console.log ("Ви ввели не число")
} else {
    if (age < 0) {                                 // перевірка введення від'ємного значення
        console.log ("Ви ввели неправильне число") 
    } else {
            if (age == 1) {                                 // якщо 1 рік
            console.log ("Вам " + age + " рік")
        } else {
            if ((age > 1) && (age <= 4)) {             // якщо 2-4 роки
                console.log ("Вам " + age + " роки")
            } else {
                if ((age > 4) && (age <= 20)) {                //якщо 5-20 років
                    console.log ("Вам " + age + " років")
                } else {                                       // якщо більше 20 років
                    var result = (age % 10);
                    if (result == 1) {                        // якщо залишок від ділення на 10 дорівнює 1
                        console.log ("Вам " + age + " рік")
                    } else {
                        if ((result > 1) && (result <= 4)) {        // якщо залишок від ділення на 10 дорівнює від 2 до 4
                            console.log ("Вам " + age + " роки")
                        } else {                                    // якщо інший залишок від ділення на 10, включаючи 0
                            console.log ("Вам " + age + " років")
                        }
                    }

                }
            }
        }
    }
};
