/* Напишіть програму яка буде приймати два значення, перше це одиниця вимірювання (кілометри, години та кілограми), друге значення це кількість, а потім переводити ці значення:

кілометри - в метри
години - в хвилини
кілограми - в грами
Зробити вивід отриманої інформації у вигляді - "10 км це 10000 м" або "1 год це 60хв", або "1 кг це 1000 г". 

Умови виконання ДЗ:

В задачі не обовʼязково викорисутовувати prompt, просто запишіть значення в зміні.
Обовʼязково при написанні завдання використовуйте switch
Продумати варінат, якщо буде введена якась інша одиниця виміру
Мудрувати та створювати валідацію не потрібно
Для перевірки вашої роботи:

Додайте ДЗ у гілку js_homework2
Вишліть посилання на вашу гілку */

var quantity = 30;
var unit_of_meassure = "год";                  // валідні значення - км, кг, год
    switch (unit_of_meassure) {
    case "км":                                                                               // якщо ввели км
        console.log (quantity + " " + unit_of_meassure + " це " + quantity*1000 + " метрів");
        break;
    case "кг":                                                                               // якщо ввели кг
        console.log (quantity + " " + unit_of_meassure + " це " + quantity*1000 + " грам");
        break;
    case "год":                                                                              // якщо ввели кг
        console.log (quantity + " " + unit_of_meassure + " це " + quantity*60 + " хвилин");
        break;
    default:                                                                                 // якщо інша одиниця виміру
        console.log ("Ви ввели неправильну одиницю виміру");
}